TestProject/src/Documents/Покупка/Покупка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Покупка</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>CatalogRef.Справочник1</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestProject/src/AccumulationRegisters/ТоварыНаСкладе/ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

TestProject/src/Documents/Покупка/ObjectModule.bsl
#Область ОбработчикиСобытий

//@skip-check module-accessibility-at-client
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Дата КАК Период,
	               |	&Склад КАК Склад,
	               |	ПокупкаТовары.Номенклатура,
	               |	СУММА(ПокупкаТовары.Количество) КАК Количество,
	               |	СУММА(ПокупкаТовары.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.Покупка.Товары КАК ПокупкаТовары
	               |ГДЕ
	               |	ПокупкаТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПокупкаТовары.Номенклатура";
	
	Движения.ТоварыНаСкладе.Записывать = Истина;
	Движения.ТоварыНаСкладе.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти
